In [9]:
import pandas as pd

filename = '../data/airlines.dat'

df = pd.read_csv(filename)
df

,1,Private flight,\N,-,N/A,Unnamed: 5,Unnamed: 6,Y
0,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
1,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
2,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N
3,5,213 Flight Unit,\N,NaN,TFU,NaN,Russia,N
4,6,223 Flight Unit State Airline,\N,NaN,CHD,CHKALOVSK-AVIA,Russia,N
...,...,...,...,...,...,...,...,...
6042,19828,Vuela Cuba,Vuela Cuba,6C,6CC,NaN,Cuba,Y
6043,19830,All Australia,All Australia,88,8K8,NaN,Australia,Y
6044,19831,Fly Europa,NaN,ER,RWW,NaN,Spain,Y
6045,19834,FlyPortugal,NaN,PO,FPT,FlyPortugal,Portugal,Y
6046,19845,FTI Fluggesellschaft,NaN,NaN,FTI,NaN,Germany,N

In [12]:
df = pd.read_csv(filename, 
                 header=None,
                 usecols=[1,4,5,6],
                 names=['name','abbrev3','longname','country'])
df

,name,abbrev3,longname,country
0,Private flight,NaN,NaN,NaN
1,135 Airways,GNL,GENERAL,United States
2,1Time Airline,RNX,NEXTIME,South Africa
3,2 Sqn No 1 Elementary Flying Training School,WYT,NaN,United Kingdom
4,213 Flight Unit,TFU,NaN,Russia
...,...,...,...,...
6043,Vuela Cuba,6CC,NaN,Cuba
6044,All Australia,8K8,NaN,Australia
6045,Fly Europa,RWW,NaN,Spain
6046,FlyPortugal,FPT,FlyPortugal,Portugal
6047,FTI Fluggesellschaft,FTI,NaN,Germany

In [14]:
df['country'].value_counts().head(10)

country
United States     1080
Mexico             439
United Kingdom     407
Canada             318
Russia             230
Spain              166
Germany            131
France             119
Australia           93
South Africa        91
Name: count, dtype: int64

In [17]:
url = 'https://gist.githubusercontent.com/reuven/77edbb0292901f35019f17edb9794358/raw/2bf258763cdddd704f8ffd3ea9a3e81d25e2c6f6/cities.json'
df = pd.read_json(url)
df

,city,growth_from_2000_to_2013,latitude,longitude,population,rank,state
0,New York,4.8%,40.712784,-74.005941,8405837,1,New York
1,Los Angeles,4.8%,34.052234,-118.243685,3884307,2,California
2,Chicago,-6.1%,41.878114,-87.629798,2718782,3,Illinois
3,Houston,11.0%,29.760427,-95.369803,2195914,4,Texas
4,Philadelphia,2.6%,39.952584,-75.165222,1553165,5,Pennsylvania
...,...,...,...,...,...,...,...
995,Weslaco,28.8%,26.159519,-97.990837,37093,996,Texas
996,Keizer,14.4%,44.990119,-123.026208,37064,997,Oregon
997,Spanish Fork,78.1%,40.114955,-111.654923,36956,998,Utah
998,Beloit,2.9%,42.508348,-89.031776,36888,999,Wisconsin
999,Panama City,0.1%,30.158813,-85.660206,36877,1000,Florida

In [18]:
df['population'].value_counts()

population
40921    2
42907    2
41301    2
40059    2
47333    2
        ..
90811    1
90412    1
90268    1
90231    1
36877    1
Name: count, Length: 993, dtype: int64

In [19]:
df['population'].value_counts().head

<bound method NDFrame.head of population
40921    2
42907    2
41301    2
40059    2
47333    2
        ..
90811    1
90412    1
90268    1
90231    1
36877    1
Name: count, Length: 993, dtype: int64>

In [20]:
df['population'].value_counts(

population
40921    False
42907    False
41301    False
40059    False
47333    False
         ...
90811    False
90412    False
90268    False
90231    False
36877    False
Name: count, Length: 993, dtype: bool